Revit 2027 API
ExternalServices.BuiltInExternalServices.PipePlumbingFixtureFlowService Property
 The external service which permits registration of an alternate implementation for pipe fixture flow calculation. To use this service, programmers implement a server class that derives from IPipePlumbingFixtureFlowServer.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId PipePlumbingFixtureFlowService { get; }
Public Shared ReadOnly Property PipePlumbingFixtureFlowService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ PipePlumbingFixtureFlowService {
	ExternalServiceId^ get ();
}
static member PipePlumbingFixtureFlowService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace